improve dark mode styles, and swap out ascii diagrams for mermaid
